ProgessBase/Documents/ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ис_ПродажиКорректировкиПродукцииМеждународныйУчет</xr:Item>
				<xr:Item>AccountingRegister.Международный</xr:Item>
				<xr:Item>AccumulationRegister.ис_СредневзвешеннаяСебестоимостьМеждународныйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКорретировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реализации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реализация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВыручки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКорректировкиВыручки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Возврат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реализация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДСВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВыручки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКорректировкиВыручки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/AccumulationRegisters/ис_ПродажиКорректировкиПродукцииМеждународныйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ис_ПродажиКорректировкиПродукцииМеждународныйУчет</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезДопСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияОтгруженныхТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПРГАдресПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.АдресаПоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ProgessBase/AccumulationRegisters/ис_СредневзвешеннаяСебестоимостьМеждународныйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ис_СредневзвешеннаяСебестоимостьМеждународныйУчет</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ProgessBase/AccountingRegisters/Международный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>Международный</Name>
			<Comment>(Упр)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Международный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПервичныйНомерСтроки</Name>
					<Comment>Необходим для переноса затрат</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПравилоПереносаДт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаСоответствияСчетовБУиМСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_НомерСтрокиПравилаПереносаДт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПравилоПереносаКт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаСоответствияСчетовБУиМСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_НомерСтрокиПравилаПереносаКт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

ProgessBase/Documents/ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчет/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
	Движения.ис_ПродажиКорректировкиПродукцииМеждународныйУчет.Очистить();
	Движения.ис_СредневзвешеннаяСебестоимостьМеждународныйУчет.Очистить();
	Движения.Международный.Очистить();
	
	лНачалоПериода = НачалоМесяца(ПериодКорретировки);
	лОкончаниеПериода = КонецМесяца(ПериодКорретировки);
	лНачалоНовогоПериода = лОкончаниеПериода+1;
	
	лЗапрос = Новый Запрос;
	лЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетРеализации.Реализация КАК Реализация,
	|	МАКСИМУМ(ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетРеализации.СуммаВыручки) КАК СуммаВыручки,
	|	МАКСИМУМ(ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетРеализации.СуммаКорректировкиВыручки) КАК СуммаКорректировкиВыручки,
	|	ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетРеализации.Возврат КАК Возврат
	|ПОМЕСТИТЬ втРеализации
	|ИЗ
	|	Документ.ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчет.Реализации КАК ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетРеализации
	|ГДЕ
	|	ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетРеализации.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетРеализации.Реализация,
	|	ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетРеализации.Возврат
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетРеализации.Реализация КАК Реализация,
	|	МАКСИМУМ(ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетРеализации.СуммаВыручки) КАК СуммаВыручки,
	|	МАКСИМУМ(ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетРеализации.СуммаКорректировкиВыручки) КАК СуммаКорректировкиВыручки,
	|	ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетРеализации.Возврат КАК Возврат,
	|	ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетНоменклатура.Номенклатура КАК Номенклатура,
	|	СУММА(ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетНоменклатура.Количество) КАК КоличествоНоменклатуры,
	|	СУММА(ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетНоменклатура.СуммаВыручки) КАК СуммаВыручкиНоменклатуры,
	|	СУММА(ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетНоменклатура.СуммаКорректировкиВыручки) КАК СуммаКорректировкиВыручкиНоменклатуры,
	|	СУММА(ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетНоменклатура.СуммаВсего) КАК СуммаВсегоНоменклатуры
	|ПОМЕСТИТЬ втРеализацииСНоменклатурой
	|ИЗ
	|	Документ.ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчет.Реализации КАК ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетРеализации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчет.Номенклатура КАК ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетНоменклатура
	|		ПО ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетРеализации.Ссылка = ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетНоменклатура.Ссылка
	|			И ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетРеализации.Реализация = ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетНоменклатура.Реализация
	|			И (ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетРеализации.Возврат = ИСТИНА)
	|			И (ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетНоменклатура.Использование = ИСТИНА)
	|ГДЕ
	|	ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетРеализации.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетРеализации.Реализация,
	|	ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетРеализации.Возврат,
	|	ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчетНоменклатура.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Реализация,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втРеализацииСНоменклатурой.Реализация КАК Реализация,
	|	МАКСИМУМ(втРеализацииСНоменклатурой.СуммаВыручки) КАК СуммаВыручки,
	|	МАКСИМУМ(втРеализацииСНоменклатурой.СуммаКорректировкиВыручки) КАК СуммаКорректировкиВыручки,
	|	втРеализацииСНоменклатурой.Возврат,
	|	втРеализацииСНоменклатурой.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	СУММА(втРеализацииСНоменклатурой.КоличествоНоменклатуры) КАК КоличествоНоменклатуры,
	|	СУММА(втРеализацииСНоменклатурой.СуммаВыручкиНоменклатуры) КАК СуммаВыручкиНоменклатуры,
	|	СУММА(втРеализацииСНоменклатурой.СуммаКорректировкиВыручкиНоменклатуры) КАК СуммаКорректировкиВыручкиНоменклатуры,
	|	СУММА(втРеализацииСНоменклатурой.СуммаВсегоНоменклатуры) КАК СуммаВсегоНоменклатуры
	|ПОМЕСТИТЬ втРеализацииСНоменклатурнымиГруппами
	|ИЗ
	|	втРеализацииСНоменклатурой КАК втРеализацииСНоменклатурой
	|
	|СГРУППИРОВАТЬ ПО
	|	втРеализацииСНоменклатурой.Реализация,
	|	втРеализацииСНоменклатурой.Возврат,
	|	втРеализацииСНоменклатурой.Номенклатура,
	|	втРеализацииСНоменклатурой.Номенклатура.НоменклатурнаяГруппа
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Реализация,
	|	НоменклатурнаяГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПродажиОбороты.Организация,
	|	ПродажиОбороты.Номенклатура,
	|	ПродажиОбороты.ХарактеристикаНоменклатуры,
	|	ПродажиОбороты.ЗаказПокупателя,
	|	ПродажиОбороты.ДоговорКонтрагента,
	|	ПродажиОбороты.Контрагент,
	|	ПродажиОбороты.ДокументПродажи,
	|	ПродажиОбороты.Подразделение,
	|	ПродажиОбороты.Проект,
	|	ПродажиОбороты.ПРГАдресПоставки,
	|	ПродажиОбороты.КоличествоОборот КАК Количество,
	|	ПродажиОбороты.СтоимостьОборот КАК Стоимость,
	|	ПродажиОбороты.СтоимостьБезСкидокОборот КАК СтоимостьБезСкидок,
	|	ПродажиОбороты.НДСОборот КАК НДС,
	|	0 КАК КоличествоНоменклатуры,
	|	втРеализации.СуммаВыручки,
	|	втРеализации.СуммаКорректировкиВыручки,
	|	втРеализации.Возврат
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(, &ОкончаниеПериодаСГраницей, Период, Организация = &Организация) КАК ПродажиОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРеализации КАК втРеализации
	|		ПО ПродажиОбороты.ДокументПродажи = втРеализации.Реализация
	|			И (втРеализации.Возврат = ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПродажиОбороты.Организация,
	|	ПродажиОбороты.Номенклатура,
	|	ПродажиОбороты.ХарактеристикаНоменклатуры,
	|	ПродажиОбороты.ЗаказПокупателя,
	|	ПродажиОбороты.ДоговорКонтрагента,
	|	ПродажиОбороты.Контрагент,
	|	ПродажиОбороты.ДокументПродажи,
	|	ПродажиОбороты.Подразделение,
	|	ПродажиОбороты.Проект,
	|	ПродажиОбороты.ПРГАдресПоставки,
	|	ПродажиОбороты.КоличествоОборот,
	|	ПродажиОбороты.СтоимостьОборот,
	|	ПродажиОбороты.СтоимостьБезСкидокОборот,
	|	ПродажиОбороты.НДСОборот,
	|	втРеализацииСНоменклатурой.КоличествоНоменклатуры,
	|	втРеализацииСНоменклатурой.СуммаВыручки,
	|	втРеализацииСНоменклатурой.СуммаКорректировкиВыручки,
	|	втРеализацииСНоменклатурой.Возврат
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(, &ОкончаниеПериодаСГраницей, Период, Организация = &Организация) КАК ПродажиОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРеализацииСНоменклатурой КАК втРеализацииСНоменклатурой
	|		ПО ПродажиОбороты.ДокументПродажи = втРеализацииСНоменклатурой.Реализация
	|			И ПродажиОбороты.Номенклатура = втРеализацииСНоменклатурой.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.Организация,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.Номенклатура,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.ХарактеристикаНоменклатуры,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.ЗаказПокупателя,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.ДоговорКонтрагента,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.Контрагент,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.ДокументПродажи,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.Подразделение,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.Проект,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.ПРГАдресПоставки,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.КоличествоОборот,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.СтоимостьОборот,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.СтоимостьБезСкидокОборот,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.НДСОборот,
	|	0,
	|	втРеализации.СуммаВыручки,
	|	втРеализации.СуммаКорректировкиВыручки,
	|	втРеализации.Возврат
	|ИЗ
	|	РегистрНакопления.ис_ПродажиКорректировкиПродукцииМеждународныйУчет.Обороты(, &ОкончаниеПериодаСГраницей, Период, Организация = &Организация) КАК ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРеализации КАК втРеализации
	|		ПО ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.ДокументПродажи = втРеализации.Реализация
	|			И (втРеализации.Возврат = ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.Организация,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.Номенклатура,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.ХарактеристикаНоменклатуры,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.ЗаказПокупателя,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.ДоговорКонтрагента,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.Контрагент,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.ДокументПродажи,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.Подразделение,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.Проект,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.ПРГАдресПоставки,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.КоличествоОборот,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.СтоимостьОборот,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.СтоимостьБезСкидокОборот,
	|	ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.НДСОборот,
	|	втРеализацииСНоменклатурой.КоличествоНоменклатуры,
	|	втРеализацииСНоменклатурой.СуммаВыручки,
	|	втРеализацииСНоменклатурой.СуммаКорректировкиВыручки,
	|	втРеализацииСНоменклатурой.Возврат
	|ИЗ
	|	РегистрНакопления.ис_ПродажиКорректировкиПродукцииМеждународныйУчет.Обороты(, &ОкончаниеПериодаСГраницей, Период, Организация = &Организация) КАК ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРеализацииСНоменклатурой КАК втРеализацииСНоменклатурой
	|		ПО ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.ДокументПродажи = втРеализацииСНоменклатурой.Реализация
	|			И ис_ПродажиКорректировкиПродукцииМеждународныйУчетОбороты.Номенклатура = втРеализацииСНоменклатурой.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МеждународныйДвиженияССубконто.СчетДт КАК СчетДт,
	|	МеждународныйДвиженияССубконто.СубконтоДт1,
	|	МеждународныйДвиженияССубконто.СубконтоДт2,
	|	МеждународныйДвиженияССубконто.СубконтоДт3,
	|	МеждународныйДвиженияССубконто.СчетКт КАК СчетКт,
	|	МеждународныйДвиженияССубконто.СубконтоКт1,
	|	МеждународныйДвиженияССубконто.СубконтоКт2,
	|	МеждународныйДвиженияССубконто.СубконтоКт3,
	|	МеждународныйДвиженияССубконто.Организация,
	|	МеждународныйДвиженияССубконто.ВалютаДт,
	|	МеждународныйДвиженияССубконто.ВалютаКт,
	|	СУММА(МеждународныйДвиженияССубконто.ВалютнаяСуммаДт) КАК ВалютнаяСуммаДт,
	|	СУММА(МеждународныйДвиженияССубконто.ВалютнаяСуммаКт) КАК ВалютнаяСуммаКт,
	|	СУММА(МеждународныйДвиженияССубконто.КоличествоДт) КАК КоличествоДт,
	|	СУММА(МеждународныйДвиженияССубконто.КоличествоКт) КАК КоличествоКт,
	|	СУММА(МеждународныйДвиженияССубконто.Сумма) КАК Сумма,
	|	МеждународныйДвиженияССубконто.ПервичныйДокумент
	|ПОМЕСТИТЬ втПроводки
	|ИЗ
	|	РегистрБухгалтерии.Международный.ДвиженияССубконто(
	|			,
	|			&ОкончаниеПериодаСГраницей,
	|			Организация = &Организация
	|				И (Регистратор ССЫЛКА Документ.ПереносПроводокМеждународный
	|					ИЛИ Регистратор ССЫЛКА Документ.ис_КорректировкаПродукцииСНеперешедшимиПравамиСобственностиМеждународныйУчет)
	|				И Активность = ИСТИНА,
	|			,
	|			) КАК МеждународныйДвиженияССубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРеализации КАК втРеализации
	|		ПО МеждународныйДвиженияССубконто.ПервичныйДокумент = втРеализации.Реализация
	|
	|СГРУППИРОВАТЬ ПО
	|	МеждународныйДвиженияССубконто.СчетДт,
	|	МеждународныйДвиженияССубконто.СубконтоДт1,
	|	МеждународныйДвиженияССубконто.СубконтоДт2,
	|	МеждународныйДвиженияССубконто.СубконтоДт3,
	|	МеждународныйДвиженияССубконто.СчетКт,
	|	МеждународныйДвиженияССубконто.СубконтоКт1,
	|	МеждународныйДвиженияССубконто.СубконтоКт2,
	|	МеждународныйДвиженияССубконто.СубконтоКт3,
	|	МеждународныйДвиженияССубконто.Организация,
	|	МеждународныйДвиженияССубконто.ВалютаДт,
	|	МеждународныйДвиженияССубконто.ВалютаКт,
	|	МеждународныйДвиженияССубконто.ПервичныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втПроводки.СчетДт КАК СчетДт,
	|	втПроводки.СубконтоДт1,
	|	втПроводки.СубконтоДт2,
	|	втПроводки.СубконтоДт3,
	|	втПроводки.СчетКт КАК СчетКт,
	|	втПроводки.СубконтоКт1,
	|	втПроводки.СубконтоКт2,
	|	втПроводки.СубконтоКт3,
	|	втПроводки.Организация,
	|	втПроводки.ВалютаДт,
	|	втПроводки.ВалютаКт,
	|	втПроводки.ВалютнаяСуммаДт КАК ВалютнаяСуммаДт,
	|	втПроводки.ВалютнаяСуммаКт КАК ВалютнаяСуммаКт,
	|	втПроводки.КоличествоДт КАК КоличествоДт,
	|	втПроводки.КоличествоКт КАК КоличествоКт,
	|	втПроводки.Сумма КАК Сумма,
	|	втПроводки.ПервичныйДокумент,
	|	втРеализации.Возврат,
	|	0 КАК КоличествоНоменклатуры,
	|	втРеализации.СуммаКорректировкиВыручки КАК СуммаКорректировки
	|ИЗ
	|	втПроводки КАК втПроводки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРеализации КАК втРеализации
	|		ПО втПроводки.ПервичныйДокумент = втРеализации.Реализация
	|			И (втРеализации.Возврат = ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втПроводки.СчетДт,
	|	втПроводки.СубконтоДт1,
	|	втПроводки.СубконтоДт2,
	|	втПроводки.СубконтоДт3,
	|	втПроводки.СчетКт,
	|	втПроводки.СубконтоКт1,
	|	втПроводки.СубконтоКт2,
	|	втПроводки.СубконтоКт3,
	|	втПроводки.Организация,
	|	втПроводки.ВалютаДт,
	|	втПроводки.ВалютаКт,
	|	втПроводки.ВалютнаяСуммаДт,
	|	втПроводки.ВалютнаяСуммаКт,
	|	втПроводки.КоличествоДт,
	|	втПроводки.КоличествоКт,
	|	втПроводки.Сумма,
	|	втПроводки.ПервичныйДокумент,
	|	втРеализацииСНоменклатурой.Возврат,
	|	втРеализацииСНоменклатурой.КоличествоНоменклатуры,
	|	втРеализацииСНоменклатурой.СуммаКорректировкиВыручкиНоменклатуры
	|ИЗ
	|	втПроводки КАК втПроводки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРеализацииСНоменклатурой КАК втРеализацииСНоменклатурой
	|		ПО втПроводки.ПервичныйДокумент = втРеализацииСНоменклатурой.Реализация
	|			И (втПроводки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Международный.ГотоваяПродукцияЗаВычетомПереоценки))
	|			И ((ВЫРАЗИТЬ(втПроводки.СубконтоКт1 КАК Справочник.Номенклатура)) = втРеализацииСНоменклатурой.Номенклатура)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втПроводки.СчетДт,
	|	втПроводки.СубконтоДт1,
	|	втПроводки.СубконтоДт2,
	|	втПроводки.СубконтоДт3,
	|	втПроводки.СчетКт,
	|	втПроводки.СубконтоКт1,
	|	втПроводки.СубконтоКт2,
	|	втПроводки.СубконтоКт3,
	|	втПроводки.Организация,
	|	втПроводки.ВалютаДт,
	|	втПроводки.ВалютаКт,
	|	СУММА(втПроводки.ВалютнаяСуммаДт),
	|	СУММА(втПроводки.ВалютнаяСуммаКт),
	|	СУММА(втПроводки.КоличествоДт),
	|	СУММА(втПроводки.КоличествоКт),
	|	СУММА(втПроводки.Сумма),
	|	втПроводки.ПервичныйДокумент,
	|	втРеализацииСНоменклатурнымиГруппами.Возврат,
	|	втРеализацииСНоменклатурнымиГруппами.КоличествоНоменклатуры,
	|	втРеализацииСНоменклатурнымиГруппами.СуммаКорректировкиВыручкиНоменклатуры
	|ИЗ
	|	втПроводки КАК втПроводки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРеализацииСНоменклатурнымиГруппами КАК втРеализацииСНоменклатурнымиГруппами
	|		ПО втПроводки.ПервичныйДокумент = втРеализацииСНоменклатурнымиГруппами.Реализация
	|			И (втПроводки.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Международный.Выручка))
	|			И ((ВЫРАЗИТЬ(втПроводки.СубконтоКт1 КАК Справочник.НоменклатурныеГруппы)) = втРеализацииСНоменклатурнымиГруппами.НоменклатурнаяГруппа)
	|
	|СГРУППИРОВАТЬ ПО
	|	втПроводки.СчетДт,
	|	втПроводки.СубконтоДт1,
	|	втПроводки.СубконтоДт2,
	|	втПроводки.СубконтоДт3,
	|	втПроводки.СчетКт,
	|	втПроводки.СубконтоКт1,
	|	втПроводки.СубконтоКт2,
	|	втПроводки.СубконтоКт3,
	|	втПроводки.Организация,
	|	втПроводки.ВалютаДт,
	|	втПроводки.ВалютаКт,
	|	втПроводки.ПервичныйДокумент,
	|	втРеализацииСНоменклатурнымиГруппами.Возврат,
	|	втРеализацииСНоменклатурнымиГруппами.КоличествоНоменклатуры,
	|	втРеализацииСНоменклатурнымиГруппами.СуммаКорректировкиВыручкиНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартииТоваровНаСкладахМеждународныйУчетОстатки.Номенклатура КАК Номенклатура,
	|	ПартииТоваровНаСкладахМеждународныйУчетОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ПартииТоваровНаСкладахМеждународныйУчетОстатки.КоличествоОстаток) КАК Количество
	|ПОМЕСТИТЬ втОстаткиКоличество
	|ИЗ
	|	РегистрНакопления.ПартииТоваровНаСкладахМеждународныйУчет.Остатки(
	|			&ОкончаниеПериодаСГраницей,
	|			Организация = &Организация
	|				И СчетУчета В (ЗНАЧЕНИЕ(ПланСчетов.Международный.ГотоваяПродукцияЗаВычетомПереоценки), ЗНАЧЕНИЕ(ПланСчетов.Международный._ПолуфабрикатыСобственногоПроизводства))) КАК ПартииТоваровНаСкладахМеждународныйУчетОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровНаСкладахМеждународныйУчетОстатки.Номенклатура,
	|	ПартииТоваровНаСкладахМеждународныйУчетОстатки.ХарактеристикаНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ис_СредневзвешеннаяСебестоимостьМеждународныйУчетОстатки.Номенклатура КАК Номенклатура,
	|	ис_СредневзвешеннаяСебестоимостьМеждународныйУчетОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ис_СредневзвешеннаяСебестоимостьМеждународныйУчетОстатки.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ис_СредневзвешеннаяСебестоимостьМеждународныйУчетОстатки.СуммаОстаток КАК Сумма
	|ПОМЕСТИТЬ втОстаткиСумма
	|ИЗ
	|	РегистрНакопления.ис_СредневзвешеннаяСебестоимостьМеждународныйУчет.Остатки(&ОкончаниеПериодаСГраницей, Организация = &Организация) КАК ис_СредневзвешеннаяСебестоимостьМеждународныйУчетОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втОстаткиКоличество.Номенклатура КАК Номенклатура,
	|	втОстаткиКоличество.ХарактеристикаНоменклатуры,
	|	втОстаткиКоличество.Количество КАК Количество,
	|	ЕСТЬNULL(втОстаткиСумма.СтатьяЗатрат, ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)) КАК СтатьяЗатрат,
	|	ЕСТЬNULL(втОстаткиСумма.Сумма, 0) КАК Сумма
	|ИЗ
	|	втОстаткиКоличество КАК втОстаткиКоличество
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОстаткиСумма КАК втОстаткиСумма
	|		ПО втОстаткиКоличество.Номенклатура = втОстаткиСумма.Номенклатура
	|			И втОстаткиКоличество.ХарактеристикаНоменклатуры = втОстаткиСумма.ХарактеристикаНоменклатуры
	|ИТОГИ
	|	МАКСИМУМ(Количество),
	|	СУММА(Сумма)
	|ПО
	|	Номенклатура";	
	лЗапрос.УстановитьПараметр("Ссылка", Ссылка);
	лЗапрос.УстановитьПараметр("Организация", Организация);
	лЗапрос.УстановитьПараметр("ОкончаниеПериодаСГраницей", Новый Граница(лОкончаниеПериода,ВидГраницы.Включая));
	лРезультатыЗапроса = лЗапрос.ВыполнитьПакет();
	
	// Расход с продаж
	лВыборка = лРезультатыЗапроса[3].Выбрать();
	Пока лВыборка.Следующий() Цикл 
		лКоэффицинт = 1;
		Если лВыборка.Возврат Тогда 
			Если ЗначениеЗаполнено(лВыборка.Количество) Тогда 
				лКоэффицинт = лВыборка.КоличествоНоменклатуры/лВыборка.Количество;
			КонецЕсли;
		КонецЕсли;
		лДвижение = Движения.ис_ПродажиКорректировкиПродукцииМеждународныйУчет.Добавить();
		ЗаполнитьЗначенияСвойств(лДвижение, лВыборка);
		лДвижение.Период = лОкончаниеПериода;
		лДвижение.Количество = -лВыборка.Количество * лКоэффицинт;
		лДвижение.Стоимость = -лВыборка.Стоимость * лКоэффицинт;
		лДвижение.СтоимостьБезСкидок = -лВыборка.СтоимостьБезСкидок * лКоэффицинт;
		лДвижение.НДС = -лВыборка.НДС * лКоэффицинт;
	КонецЦикла;
	// Приход на продажи
	лВыборка = лРезультатыЗапроса[3].Выбрать();
	Пока лВыборка.Следующий() Цикл 
		Если НЕ лВыборка.Возврат Тогда
			лДвижение = Движения.ис_ПродажиКорректировкиПродукцииМеждународныйУчет.Добавить();
			ЗаполнитьЗначенияСвойств(лДвижение, лВыборка);
			лДвижение.Период = лНачалоНовогоПериода;
		КонецЕсли;
	КонецЦикла;
	
	лСебестоимость = лРезультатыЗапроса[8].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Расход с проводок
	лВыборка = лРезультатыЗапроса[5].Выбрать();
	ПервичныйДокумент = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	СуммаДокумента = 0;
	Пока лВыборка.Следующий() Цикл 
		Если лВыборка.СчетДт.Родитель = ПланыСчетов.Международный._Продажи
			и лВыборка.СчетКт.Родитель = ПланыСчетов.Международный.ТекущиеНалогиКУплате Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ПервичныйДокумент <> лВыборка.ПервичныйДокумент Тогда
			ПервичныйДокумент = лВыборка.ПервичныйДокумент;
			СуммаДокумента = ОбщегоНазначения.ФорматСумм(УчетНДС.ПолучитьСуммуДокументаСНДС(ПервичныйДокумент, "Товары"))-ОбщегоНазначения.ФорматСумм(ПервичныйДокумент.Товары.Итог("СуммаНДС"));
			СуммаККорректировке = лВыборка.СуммаКорректировки;
		КонецЕсли;
		
		лПроводка = Движения.Международный.Добавить();
		лПроводка.Период = лОкончаниеПериода;
		лПроводка.Организация = Организация;
		лПроводка.СчетДт = лВыборка.СчетДт;
		Для лНомерСубконто=1 По лПроводка.СчетДт.ВидыСубконто.Количество() Цикл 
			БухгалтерскийУчет.УстановитьСубконто(лПроводка.СчетДт, лПроводка.СубконтоДт, лНомерСубконто, лВыборка["СубконтоДт"+лНомерСубконто]);
		КонецЦикла;
		Если лПроводка.СчетДт.Количественный Тогда 
			лПроводка.КоличествоДт = -лВыборка.КоличествоДт;
		КонецЕсли;
		Если лПроводка.СчетДт.Валютный Тогда 
			лПроводка.ВалютаДт = лВыборка.ВалютаДт;
			лПроводка.ВалютнаяСуммаДт = -лВыборка.ВалютнаяСуммаДт;
		КонецЕсли;
		лПроводка.СчетКт = лВыборка.СчетКт;
		Для лНомерСубконто=1 По лПроводка.СчетКт.ВидыСубконто.Количество() Цикл 
			БухгалтерскийУчет.УстановитьСубконто(лПроводка.СчетКт, лПроводка.СубконтоКт, лНомерСубконто, лВыборка["СубконтоКт"+лНомерСубконто]);
		КонецЦикла;
		Если лПроводка.СчетКт.Количественный Тогда 
			лПроводка.КоличествоКт = -лВыборка.КоличествоКт;
		КонецЕсли;
		Если лПроводка.СчетКт.Валютный Тогда 
			лПроводка.ВалютаКт = лВыборка.ВалютаКт;
			лПроводка.ВалютнаяСуммаКт = -лВыборка.ВалютнаяСуммаКт;
		КонецЕсли;
		Если лВыборка.СчетДт.Родитель = ПланыСчетов.Международный._РасчетыСПокупателямиИЗаказчиками
			И лВыборка.СчетКт.Родитель = ПланыСчетов.Международный._Продажи Тогда
			лПроводка.Сумма = -лВыборка.Сумма;
			лПроводка.Сумма = -ПолучитьСуммуПроводкиПоВыручке(лВыборка, СуммаККорректировке);
			СуммаККорректировке = СуммаККорректировке + лПроводка.Сумма;
		Иначе
			лПроводка.Сумма = -лВыборка.Сумма;
		КонецЕсли;
		лПроводка.ПервичныйДокумент = лВыборка.ПервичныйДокумент;
		лПроводка.Содержание = "Корректировка реализации продукции с неперешедшим правом собственности (сторно)";
		// Себестоимость
		Если лВыборка.СчетДт = ПланыСчетов.Международный.СебестоимостьПродаж
		 И лВыборка.СчетКт = ПланыСчетов.Международный.ГотоваяПродукцияЗаВычетомПереоценки Тогда 
	 		лКоличество = ?(лВыборка.Возврат, лВыборка.КоличествоНоменклатуры, лВыборка.КоличествоКт);
		 	лСтрокаСебестоимости = лСебестоимость.Строки.Найти(лВыборка.СубконтоКт1, "Номенклатура");
			Если лСтрокаСебестоимости <> Неопределено Тогда 
				Если ЗначениеЗаполнено(лСтрокаСебестоимости.Количество) Тогда 
					лПроводка.Сумма = -лСтрокаСебестоимости.Сумма/лСтрокаСебестоимости.Количество * лКоличество;
					// Движения по себестоимости
					Для Каждого лСтрокаСтатьиЗатрат Из лСтрокаСебестоимости.Строки Цикл 
						лДвижение = Движения.ис_СредневзвешеннаяСебестоимостьМеждународныйУчет.Добавить();
						лДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;
						лДвижение.Период = лОкончаниеПериода;
						лДвижение.Номенклатура = лСтрокаСтатьиЗатрат.Номенклатура;
						лДвижение.ХарактеристикаНоменклатуры = лСтрокаСтатьиЗатрат.ХарактеристикаНоменклатуры;
						лДвижение.СтатьяЗатрат = лСтрокаСтатьиЗатрат.СтатьяЗатрат;
						лДвижение.Сумма = -лСтрокаСтатьиЗатрат.Сумма/лСтрокаСтатьиЗатрат.Количество * лКоличество;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// Коррекция по возврату
		Если лВыборка.Возврат Тогда 
			Если лПроводка.СчетДт.Количественный И ЗначениеЗаполнено(лПроводка.КоличествоДт) Тогда 
				лПроводка.КоличествоДт = -лВыборка.КоличествоНоменклатуры;
			КонецЕсли;
			Если лПроводка.СчетКт.Количественный И ЗначениеЗаполнено(лПроводка.КоличествоКт) Тогда 
				лПроводка.КоличествоКт = -лВыборка.КоличествоНоменклатуры;
			КонецЕсли;
			Если лПроводка.СчетДт.Валютный И ЗначениеЗаполнено(лПроводка.ВалютнаяСуммаДт) Тогда 
				лПроводка.ВалютнаяСуммаДт = -лПроводка.Сумма/лВыборка.Сумма * лПроводка.ВалютнаяСуммаДт;
			КонецЕсли;
			Если лПроводка.СчетКт.Валютный И ЗначениеЗаполнено(лПроводка.ВалютнаяСуммаКт) Тогда 
				лПроводка.ВалютнаяСуммаКт = -лПроводка.Сумма/лВыборка.Сумма * лПроводка.ВалютнаяСуммаКт;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	// Приход на проводки
	лВыборка = лРезультатыЗапроса[5].Выбрать();
	Пока лВыборка.Следующий() Цикл 
		Если НЕ лВыборка.Возврат Тогда
			
			Если лВыборка.СчетДт.Родитель = ПланыСчетов.Международный._Продажи
				и лВыборка.СчетКт.Родитель = ПланыСчетов.Международный.ТекущиеНалогиКУплате Тогда 
				Продолжить;
			КонецЕсли;
			
			Если ПервичныйДокумент <> лВыборка.ПервичныйДокумент Тогда
				ПервичныйДокумент = лВыборка.ПервичныйДокумент;
				СуммаДокумента = ОбщегоНазначения.ФорматСумм(УчетНДС.ПолучитьСуммуДокументаСНДС(ПервичныйДокумент, "Товары"))-ОбщегоНазначения.ФорматСумм(ПервичныйДокумент.Товары.Итог("СуммаНДС"));
				СуммаККорректировке = лВыборка.СуммаКорректировки;
			КонецЕсли;
			
			лПроводка = Движения.Международный.Добавить();
			лПроводка.Период = лНачалоНовогоПериода;
			лПроводка.Организация = Организация;
			лПроводка.СчетДт = лВыборка.СчетДт;
			Для лНомерСубконто=1 По лПроводка.СчетДт.ВидыСубконто.Количество() Цикл 
				БухгалтерскийУчет.УстановитьСубконто(лПроводка.СчетДт, лПроводка.СубконтоДт, лНомерСубконто, лВыборка["СубконтоДт"+лНомерСубконто]);
			КонецЦикла;
			Если лПроводка.СчетДт.Количественный Тогда 
				лПроводка.КоличествоДт = лВыборка.КоличествоДт;
			КонецЕсли;
			Если лПроводка.СчетДт.Валютный Тогда 
				лПроводка.ВалютаДт = лВыборка.ВалютаДт;
				лПроводка.ВалютнаяСуммаДт = лВыборка.ВалютнаяСуммаДт;
			КонецЕсли;
			лПроводка.СчетКт = лВыборка.СчетКт;
			Для лНомерСубконто=1 По лПроводка.СчетКт.ВидыСубконто.Количество() Цикл 
				БухгалтерскийУчет.УстановитьСубконто(лПроводка.СчетКт, лПроводка.СубконтоКт, лНомерСубконто, лВыборка["СубконтоКт"+лНомерСубконто]);
			КонецЦикла;
			Если лПроводка.СчетКт.Количественный Тогда 
				лПроводка.КоличествоКт = лВыборка.КоличествоКт;
			КонецЕсли;
			Если лПроводка.СчетКт.Валютный Тогда 
				лПроводка.ВалютаКт = лВыборка.ВалютаКт;
				лПроводка.ВалютнаяСуммаКт = лВыборка.ВалютнаяСуммаКт;
			КонецЕсли;
			Если лВыборка.СчетДт.Родитель = ПланыСчетов.Международный._РасчетыСПокупателямиИЗаказчиками
				И лВыборка.СчетКт.Родитель = ПланыСчетов.Международный._Продажи Тогда
				лПроводка.Сумма = ПолучитьСуммуПроводкиПоВыручке(лВыборка, СуммаККорректировке);
				СуммаККорректировке = СуммаККорректировке - лПроводка.Сумма;
			Иначе
				лПроводка.Сумма = лВыборка.Сумма;
			КонецЕсли;
			лПроводка.ПервичныйДокумент = лВыборка.ПервичныйДокумент;
			лПроводка.Содержание = "Корректировка реализация продукции с неперешедшим правом собственности";
			Если лВыборка.СчетДт = ПланыСчетов.Международный.СебестоимостьПродаж
			 И лВыборка.СчетКт = ПланыСчетов.Международный.ГотоваяПродукцияЗаВычетомПереоценки Тогда 
		 		лКоличество = ?(лВыборка.Возврат, лВыборка.КоличествоНоменклатуры, лВыборка.КоличествоКт);
			 	лСтрокаСебестоимости = лСебестоимость.Строки.Найти(лВыборка.СубконтоКт1, "Номенклатура");
				Если лСтрокаСебестоимости <> Неопределено Тогда 
					Если ЗначениеЗаполнено(лСтрокаСебестоимости.Количество) Тогда 
						лПроводка.Сумма = лСтрокаСебестоимости.Сумма/лСтрокаСебестоимости.Количество * лКоличество;
						// Движения по себестоимости
						Для Каждого лСтрокаСтатьиЗатрат Из лСтрокаСебестоимости.Строки Цикл 
							лДвижение = Движения.ис_СредневзвешеннаяСебестоимостьМеждународныйУчет.Добавить();
							лДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;
							лДвижение.Период = лНачалоНовогоПериода;
							лДвижение.Номенклатура = лСтрокаСтатьиЗатрат.Номенклатура;
							лДвижение.ХарактеристикаНоменклатуры = лСтрокаСтатьиЗатрат.ХарактеристикаНоменклатуры;
							лДвижение.СтатьяЗатрат = лСтрокаСтатьиЗатрат.СтатьяЗатрат;
							лДвижение.Сумма = лСтрокаСтатьиЗатрат.Сумма/лСтрокаСтатьиЗатрат.Количество * лКоличество;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Движения.ис_ПродажиКорректировкиПродукцииМеждународныйУчет.Записать();
	Движения.ис_СредневзвешеннаяСебестоимостьМеждународныйУчет.Записать();
	Движения.Международный.Записать();
	
КонецПроцедуры

Функция ПолучитьСуммуПроводкиПоВыручке(Выборка, ОстатокСуммы)
	
	Если Выборка.Возврат Тогда 
		Сумма = Выборка.СуммаКорректировки;
	Иначе
		СуммаПроводки = Выборка.Сумма;
		СуммаДокументаВсего = ОбщегоНазначения.ФорматСумм(УчетНДС.ПолучитьСуммуДокументаСНДС(Выборка.ПервичныйДокумент, "Товары"));//-ОбщегоНазначения.ФорматСумм(лВыборка.ПервичныйДокумент.Товары.Итог("СуммаНДС"));
		СуммаДокументаИзТЧ = Выборка.СуммаКорректировки;
		Если СуммаДокументаВсего = 0 Тогда 
			Возврат 0;
		КонецЕсли;
		Сумма = СуммаПроводки/СуммаДокументаВсего*СуммаДокументаИзТЧ;
		Если Цел(Сумма - ОстатокСуммы) = 0 Тогда 
			Сумма = ОстатокСуммы;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Сумма;
КонецФункции
